{
  "headline":
    "A flexible and easy way to \nconnect and extend enterprise applications in a cloud-native world",
  "mission": {
    "headline": "Kyma mission: \nMake simple things simple again!",
    "paragraphs": [
      "Kyma aims to equip enterprise software users with agile tools to customize, extend, and integrate any API-enabled application and tailor it to their needs.",
      "Kyma makes the development and operation of microservices-based solutions easy by providing consistent service management capabilities and the integration of the existing enterprise software in a service-oriented manner."
    ]
  },
  "whatIs": {
    "headline": "What is Kyma?",
    "paragraphs": [
      "Kyma is a cloud-native application development framework.",
      "It provides the last mile capabilities that a developer needs to build a cloud-native application using several open-source projects such as Kubernetes, Istio, NATS, Kubeless, and Prometheus, to name a few.",
      "It is designed natively on Kubernetes and, therefore, it is portable to all major cloud providers."
    ],
    "action": "Get it on {{site}}"
  },
  "features": [
    {
      "id": "openAndExtendable",
      "headline": "Open and extendable",
      "bulletPoints": [
        "Consume services from different sources.",
        "Unify the consumption of internal and external services through the Open Service Broker standard-compliant Service Catalog."
      ]
    },
    {
      "id": "seamlessConnectivity",
      "headline": "Seamless connectivity",
      "bulletPoints": [
        "Leverage HTTP/2 for optimized latency and payload.",
        "Ensure flexible add-on triggers, including Events and HTTP requests."
      ]
    },
    {
      "id": "coherentAndTechnologyIndependent",
      "headline": "Coherent and technology-independent",
      "bulletPoints": [
        "A programming language-agnostic add-on model that allows you to customize a software solution using the technology stack you are most experienced with."
      ]
    }
  ]
}
