{
  "headline":
    "A flexible and easy way to \nconnect and extend enterprise applications in a cloud-native world",
  "whatIs": {
    "headline": "What is Kyma?",
    "paragraphs": [
      "Kyma is an open-source project designed natively on Kubernetes. It allows you to extend and customize cloud-based and on-premise enterprise applications in a quick and modern way, using serverless computing and microservice architecture.",
      "Use Kyma to create extensions for the existing systems, regardless of the language they are written in. Customize your extensions with minimum effort and time devoted to learning their configuration details."
    ],
    "action": "Get it on {{site}}"
  },
  "makesSpecial": {
    "headline": "What makes Kyma so special?",
    "paragraphs": [
      "Major open-source and cloud-native projects, such as Istio, NATS, Kubeless, and Prometheus, constitute 90% of Kyma. Its uniqueness lies in the \"glue\" that holds these components together. It collects those cutting-edge solutions in one place and combines them with the 10% of in-house developed features that allow you to create application extensions, and connect services easily and intuitively in one place."
    ],
    "action": "Read the Docs"
  },
  "features": [
    {
      "id": "applicationConnector",
      "headline": "Application Connector",
      "bulletPoints": [
        "Simplifies and secures the connection between external systems and Kyma",
        "Registers external Events and APIs in the Service Catalog",
        "Provides asynchronous communication with services and lambdas deployed in Kyma through Events",
        "Manages access to external systems"
      ]
    },
    {
      "id": "serverless",
      "headline": "Serverless",
      "bulletPoints": [
        "Ensures quick deployments",
        "Enables scaling independent of the core applications",
        "Gives a possibility to revert changes without causing production system downtime"
      ]
    },
    {
      "id": "serviceCatalog",
      "headline": "Service Catalog",
      "bulletPoints": [
        "Connects services from external sources",
        "Unifies the consumption of internal and external services thanks to compliance with the Open Service Broker standard"
      ]
    }
  ]
}
