{
  "id": "tracing",
  "displayName": "Tracing",
  "description": "Overal documentation for Tracing",
  "type": "Components",
  "docs": [
    {
      "order": "001-overview-tracing",
      "title": "Overview",
      "source": "<p>The micro-services based architecture differs from the traditional monoliths in many aspects. From the request observability perspective, there are asynchronous boundaries among various different micro-services that compose a request flow. Moreover, these micro-services can have heterogeneous semantics when it comes to monitoring and observability. It is required to have a tracing solution that can provide a holistic view of the request flow and help the developer understand the system better to take informed decisions regarding troubleshooting and performance optimization.</p>\n<p>Tracing in Kyma uses <a href=\"https://www.jaegertracing.io/docs/\" target=\"_blank\">Jaeger</a> as a backend which serves as the query mechanism for displaying information about traces. Jaeger is used for monitoring and troubleshooting microservice-based distributed systems, including:</p>\n<ul>\n<li>Distributed context propagation</li>\n<li>Distributed transaction monitoring</li>\n<li>Root cause analysis</li>\n<li>Service dependency analysis</li>\n<li>Performance and latency optimization</li>\n</ul>\n<p>Jaeger provides compatibility with the Zipkin protocol. The compatibility makes it possible to use Zipkin protocol and clients in Istio, Envoy, and Kyma services.</p>\n<p>You can access the Jaeger UI either locally at <code>https://jaeger.kyma.local</code> or on a cluster at <code>https://jaeger.{domain-of-kyma-cluster}</code>. </p>\n"
    },
    {
      "order": "010-details-http-headers",
      "title": "Propagate HTTP headers",
      "type": "Details",
      "source": "<p>The envoy proxy controls the inbound and outbound traffic in the application and automatically sends the trace information to the Zipkin. However, to track the flow of the REST API calls or the service injections in Kyma, it requires the minimal application cooperation from the micro-services code. For this purpose, you need to configure the application to propagate the tracing context in HTTP headers when making outbound calls. See the <a href=\"https://istio.io/docs/tasks/telemetry/distributed-tracing.html#understanding-what-happened\" target=\"_blank\">Istio documentation</a> for details on which headers are required to ensure the correct tracing in Kyma.</p>\n"
    },
    {
      "order": "020-architecture-tracing",
      "title": "Architecture",
      "source": "<p>See the diagram and steps for an overview of the tracing flow in Kyma:</p>\n<p><img src=\"assets/tracing-architecture.png\" alt=\"Tracing architecture\"></p>\n<p>The central element of the tracing architecture in Kyma is istio-jaeger. This main component serves both as a target of all query requests made from the Jaeger UI and the space for storing and processing the spans and traces created by Envoy and Kyma services.</p>\n<h2 id=\"request-traces\">Request traces</h2>\n<ol>\n<li>Kyma user accesses Jaeger UI and requests the trace details for a given service by selecting the service from the <strong>Services</strong> drop-down menu and confirming the choice by selecting the <strong>Find Traces</strong> button.</li>\n<li>Jaeger passes the request to the the UI facade, jaeger-query.</li>\n<li>The jaeger-query forwards the details to the istio-jaeger component which sends the information back.</li>\n</ol>\n<p><img src=\"assets/request-traces.png\" alt=\"Request traces\"></p>\n<h2 id=\"store-traces\">Store traces</h2>\n<ol>\n<li>Kyma user configures the application to propagate the correct <a href=\"https://istio.io/docs/tasks/telemetry/distributed-tracing.html#understanding-what-happened\" target=\"_blank\">HTTP headers</a> for the outbound calls.</li>\n<li>Envoy passes the trace details to the Zipkin Kubernetes service. This service acts as a facade to receive the trace and span details.</li>\n<li>Zipkin service forwards the tracing information to the istio-jaeger component which processes the received details.</li>\n</ol>\n<p><img src=\"assets/store-traces.png\" alt=\"Store traces\"></p>\n"
    }
  ]
}
