{
  "headline": "Extend your applications\nwith Kubernetes",
  "whatIs": {
    "headline": "What is Kyma?",
    "paragraphs": [
      "Kyma /kee-ma/ is a platform for extending applications through microservices and JavaScript code snippets called lambda functions. It provides CLI and UI through which you can connect your application with a Kubernetes cluster and expose the application's API or Events securely thanks to the Kyma's Application Connector.",
      "You can create microservices or serverless functions which react to particular Events or calls to your application's API and implement the business logic you just created. You can always limit the time spent on coding and simply consume the in-built cloud services from the Service Catalog portfolio, exposed by open service brokers from such cloud providers as GCP, Azure, and AWS."
    ],
    "XXXLutzBlogPost": {
      "paragraph": "{link} Kyma experience by XXXLutz KG, one of the leading furniture retailers.",
      "link": "Learn about"
    },
    "installButton": "Install"
  },
  "makeSpecial": {
    "monolithes": {
      "headline": "Don't rewrite your monoliths",
      "paragraph": "Rewriting monolithic applications where all components are interdependent is hard, costs a fortune, and in most cases is not needed. Kyma allows you to extend such applications with microservices and lambda functions that implement the exact business logic you require, without affecting your current framework. For example, you can use Kyma to connect your application to an external database and use it for storing only specific Event types coming from your application.",
      "readDocsButton": "Read the Docs"
    },
    "rightTechnologies": {
      "headline": "We picked the right technologies for you",
      "paragraph": "We not only offer a development platform but also make sure it is properly configured, secured, and monitored. Kyma combines various open-source projects that handle authentication, logging, eventing, alerting, and tracing. We enhanced them with our in-house components and services for asset management, testing, and connectivity. We made sure all these components play well together and are up-to-date so you can only focus on writing and using new features.",
      "readDocsButton": "Read the Docs"
    }
  },
  "keyFeatures": {
    "headline": "Key features",
    "seeButton": "See all Key Features",
    "readMoreLink": "Read More",
    "applicationConnector": {
      "id": "applicationConnector",
      "headline": "Application Connector",
      "paragraph": "It connects external on-premise or cloud-native applications with Kyma and registers their APIs and Events that internal applications or functions can later consume."
    },
    "serverless": {
      "id": "serverless",
      "headline": "Serverless",
      "paragraph": "It is based on Kubeless and allows you to write short code snippets, known as functions or lambdas, that consume the Events exposed by the Application Connector and use external services provided by the Service Catalog to trigger certain business logic."
    },
    "serviceManagement": {
      "id": "serviceManagement",
      "headline": "Service Management",
      "paragraph": "It offers third-party services in the form of Service Classes exposed by the Service Brokers that a given function can consume to perform certain actions."
    }
  },
  "community": {
    "headline": "Connect with the Kyma community and get involved!",
    "paragraphs": [
      "Kyma has an active and vibrant community that supports its development and helps to drive it forward.",
      "Join the community and participate in our {sigLink} meetings"
    ],
    "sigLink": "Special Interest Group and Working Group",
    "linksHeader": "Talk to us!"
  },
  "earlyAdopters": {
    "headline": "Early adopters"
  }
}