{
  "id": "service-mesh",
  "displayName": "Service Mesh",
  "description": "Overal documentation for Service Mesh",
  "type": "Components",
  "docs": [
    {
      "order": "01-01-service-mesh",
      "title": "Overview",
      "source": "<p>Kyma Service Mesh is the component responsible for service-to-service communication, proxying, service discovery, traceability, and security. Kyma Service Mesh\nis based on <a href=\"https://istio.io/docs/concepts/what-is-istio/overview.html\" target=\"_blank\">Istio</a> open platform. The main principle of Kyma Service Mesh operation is the process of injecting Pods of every service with an Envoy - a sidecar proxy which intercepts the communication between the services and regulates it by applying and enforcing the rules you create. Kyma <a href=\"https://github.com/coreos/dex\" target=\"_blank\">Dex</a>, which is also a part of the Service Mesh, allows you to integrate any <a href=\"https://openid.net/connect/\" target=\"_blank\">OpenID Connect</a>-compliant identity provider or a SAML2-based enterprise authentication server with your solution.</p>\n<p>See this <a href=\"https://istio.io/docs/concepts/what-is-istio/arch.svg\" target=\"_blank\">Istio diagram</a> to understand the relationship between the Istio components and Services.</p>\n"
    },
    {
      "order": "03-01-sidecar-proxy-injection",
      "title": "Sidecar Proxy Injection",
      "type": "Details",
      "source": "<p>By default, the Istio sidecar injector watches all Pod creation operations on all Namespaces and injects the newly created Pods with a sidecar proxy.</p>\n<p>You can disable sidecar proxy injection for either an entire Namespace or a single Deployment.</p>\n<ul>\n<li>To disable sidecar proxy injection for a Namespace, set the <strong>istio-injection</strong> label value to <code>disabled</code> for the Namespace in which you want to disable the sidecar proxy injection. Use this command: <code>kubectl label namespace {YOUR_NAMESPACE} istio-injection=disabled</code>                                                                                                                                                                                </li>\n<li>To disable sidecar proxy injection for a Deployment, add this annotation to the Deployment configuration file: <code>sidecar.istio.io/inject: &quot;false&quot;</code></li>\n</ul>\n<p>Read the <a href=\"https://istio.io/docs/setup/kubernetes/sidecar-injection.html\" target=\"_blank\">Installing the Istio Sidecar</a> document to learn more about sidecar proxy injection.</p>\n"
    },
    {
      "order": "03-02-istio-patch",
      "title": "Istio patch",
      "type": "Details",
      "source": "<p>As a core component, Istio installs with every Kyma deployment by default. The installation consists of two steps:</p>\n<ol>\n<li>Istio installs using the official, raw charts from the currently supported release. The charts that are currently\nused are stored in the <code>resources/istio</code> directory. The installation is customized by enabling security in Istio.</li>\n</ol>\n<blockquote>\n<p><strong>NOTE:</strong> Every installation of Istio for Kyma must have security enabled.</p>\n</blockquote>\n<ol start=\"2\">\n<li>A custom Istio patch is applied to further customize the Istio installation. A Kubernetes job introduces these changes:<ul>\n<li>Sets a memory limit for every sidecar.</li>\n<li>Modifies Istio components to use Zipkin in the <code>kyma-system</code> Namespace, instead of the default <code>istio-system</code>.</li>\n<li>Adds a webhook to the Istio Pilot.</li>\n<li>Creates a TLS certificate for the Ingress Gateway.</li>\n<li>Deletes all resources related to the <code>prometheus</code>, <code>tracing</code>, <code>grafana</code>, and <code>servicegraph</code>charts.</li>\n<li>Enables sidecar injection in all Namespaces, except those labeled with <code>istio-injection: disabled</code>.</li>\n</ul>\n</li>\n</ol>\n<p>To learn more about the custom Istio patch applied in Kyma, see the <code>components/istio-kyma-patch/</code> directory.</p>\n<h2 id=\"use-an-existing-istio-installation-with-kyma\">Use an existing Istio installation with Kyma</h2>\n<p>You can use an existing installation of Istio running on Kubernetes with Kyma. The custom Istio patch is applied to such an installation.</p>\n<blockquote>\n<p><strong>NOTE:</strong> You cannot skip applying the Istio patch in the Kyma installation process.</p>\n</blockquote>\n<p>To allow such implementation, you must install Kyma without Istio. Read <a href=\"/root/kyma#installation-custom-component-installation\">this</a> document for more details.</p>\n"
    }
  ]
}
